# Завдання 3
"""
Розробіть скрипт, який приймає шлях до директорії в якості аргументу командного рядка і
візуалізує структуру цієї директорії, виводячи імена всіх піддиректорій та файлів.
Для кращого візуального сприйняття, імена директорій та файлів мають відрізнятися за кольором.

Вимоги до завдання:
Створіть віртуальне оточення Python для ізоляції залежностей проекту.
Скрипт має отримувати шлях до директорії як аргумент при запуску. Цей шлях вказує, де знаходиться директорія,
структуру якої потрібно відобразити.
Використання бібліотеки colorama для реалізації кольорового виведення.
Скрипт має коректно відображати як імена директорій, так і імена файлів, використовуючи рекурсивний спосіб
обходу директорій (можна, за бажанням, використати не рекурсивний спосіб).
Повинна бути перевірка та обробка помилок, наприклад, якщо вказаний шлях не існує або він не веде до директорії.

Рекомендації для виконання:
Спочатку встановіть бібліотеку colorama. Для цього створіть та активуйте віртуальне оточення Python,
а потім встановіть пакет за допомогою pip.
Використовуйте модуль sys для отримання шляху до директорії як аргументу командного рядка.
Для роботи з файловою системою використовуйте модуль pathlib.
Забезпечте належне форматування виводу, використовуючи функції colorama.

Критерії оцінювання:
Створення та використання віртуального оточення.
Правильність отримання та обробки шляху до директорії.
Точність виведення структури директорії.
Коректне застосування кольорового виведення за допомогою colorama.
Якість коду, включаючи читабельність, структурування та коментарі.

Приклад використання:
Якщо виконати скрипт та передати йому абсолютний шлях до директорії як параметр.
python hw03.py /шлях/до/вашої/директорії

Це призведе до виведення в терміналі списку всіх піддиректорій та файлів у вказаній директорії з
використанням різних кольорів для піддиректорій та файлів, що полегшить візуальне сприйняття файлової структури.
"""
import sys
from pathlib import Path
from colorama import Fore, Style


def directory_structure(directory, indent=""):
    """
    The function prints to the terminal a list of all subdirectories
    and files in the specified directory using the colorama module.
    """
    path = Path(directory)

    if not path.exists():
        print(Fore.RED + "Eror: The specified directory does not exist!")
        return

    print(Fore.BLUE + indent + f"{path.name}/" + Style.RESET_ALL)

    for item in sorted(path.iterdir()):
        if item.is_dir():
            directory_structure(item, indent + "  ")
        else:
            print(Fore.GREEN + indent + f"{item.name}" + Style.RESET_ALL)


if __name__ == "__main__":

    if len(sys.argv) < 2:
        print(
            Fore.RED
            + "Error: Please provide a directory path as a command-line argument."
            + Style.RESET_ALL
        )
        sys.exit(1)

directory_structure(sys.argv[1])
